      **
      * COPY BOOK MOVIES DATA FILE
      **
       01 REG-FIL.                  *> LRECL 100
           03 CODIGO                PIC 9(05).
           03 TITULO                PIC X(30).
           03 GENERO                PIC X(08).
           03 DURACAO               PIC 9(03).
           03 DISTRIB               PIC X(15).
           03 NOTA                  PIC 9(02).
           03 FILLER                PIC X(37).
